Таблица = Новый ТаблицаЗначений;
Квалификатор = Новый КвалификаторыСтроки(9);
ТипКода = Новый ОписаниеТипов("Строка",, Квалификатор);
Таблица.Колонки.Добавить("Код", ТипКода);
Таблица.Колонки.Добавить("Сумма");
Запрос = Новый Запрос;
Запрос.Текст =
    "ВЫБРАТЬ
    |    Спр.Ссылка КАК Ссылка
    |ИЗ
    |    Справочник.Номенклатура КАК Спр
    |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ &Таблица КАК Т
    |        ПО Спр.Код = Т.Код";
Запрос.УстановитьПараметр("Таблица", Таблица);
Результат = Запрос.Выполнить();
