Функция ТоварыДокумента(Ссылка)
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |    Товары.Номенклатура КАК Номенклатура,
        |    Товары.Количество КАК Количество
        |ИЗ
        |    Документ.Поступление.Товары КАК Товары
        |ГДЕ
        |    Товары.Ссылка = &Ссылка";
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();
    Строки = Новый Массив;
    Пока Выборка.Следующий() Цикл
        Строка = Новый Структура;
        Строка.Вставить("Номенклатура", Выборка.Номенклатура);
        Строка.Вставить("Количество", Выборка.Количество);
        Строки.Добавить(Строка);
    КонецЦикла;
    Возврат Строки;
КонецФункции
