#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеОбъекта(ТекущийОбъект)

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюОбъекта(Отказ, ТекущийОбъект, ПараметрыЗаписи)

КонецПроцедуры

&НаСервере
Процедура ЗаписатьОбъект(Отказ, ТекущийОбъект, ПараметрыЗаписи)

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиОбъекта(ТекущийОбъект, ПараметрыЗаписи)

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеНаСервере(Отказ, ПроверяемыеРеквизиты)

КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойНастроек(Настройки)

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеНастроек(Настройки)

КонецПроцедуры

&НаСервере
Процедура ПриСохраненииНастроек(Настройки)

КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)

КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти