Запрос = Новый Запрос;
Запрос.Текст =
"ВЫБРАТЬ
|    Оплаты.Заказ КАК Заказ,
|    СУММА(Оплаты.Сумма) КАК СуммаОплат
|ПОМЕСТИТЬ ВТИтогиОплат
|ИЗ
|    Документ.Оплата КАК Оплаты
|СГРУППИРОВАТЬ ПО
|    Оплаты.Заказ
|ИНДЕКСИРОВАТЬ ПО
|    Заказ
|;
|ВЫБРАТЬ
|    Заказы.Ссылка КАК Ссылка,
|    ЕСТЬNULL(ИтогиОплат.СуммаОплат, 0) КАК СуммаОплат
|ИЗ
|    Документ.Заказ КАК Заказы
|        ЛЕВОЕ СОЕДИНЕНИЕ ВТИтогиОплат КАК ИтогиОплат
|        ПО Заказы.Ссылка = ИтогиОплат.Заказ";
РезультатЗапроса = Запрос.Выполнить();

Процедура ДозаполнитьКурсВалют(Валюта)
    ЗапросКурса = Новый Запрос;
    ЗапросКурса.Текст =
    "ВЫБРАТЬ
    |    (ВЫБРАТЬ ПЕРВЫЕ 1 Курсы.Курс
    |     ИЗ РегистрСведений.КурсыВалют КАК Курсы
    |     ГДЕ Курсы.Валюта = &Валюта
    |     УПОРЯДОЧИТЬ ПО
    |         Курсы.Период УБЫВ) КАК Курс
    |ИЗ
    |    Справочник.Валюты КАК Валюты";
    ЗапросКурса.УстановитьПараметр("Валюта", Валюта);
    РезультатЗапроса = ЗапросКурса.Выполнить();
КонецПроцедуры
