Запрос = Новый Запрос;
Запрос.Текст =
"ВЫБРАТЬ
|    Товары.Ссылка КАК Заказ,
|    СУММА(Товары.Сумма) КАК Сумма
|ПОМЕСТИТЬ ИтогиТоваров
|ИЗ
|    Документ.Заказ.Товары КАК Товары
|СГРУППИРОВАТЬ ПО
|    Товары.Ссылка
|ИНДЕКСИРОВАТЬ ПО
|    Заказ
|;
|ВЫБРАТЬ
|    Заказы.Ссылка КАК Ссылка,
|    ИтогиТоваров.Сумма КАК Сумма
|ИЗ
|    Документ.Заказ КАК Заказы
|        ЛЕВОЕ СОЕДИНЕНИЕ ИтогиТоваров КАК ИтогиТоваров
|        ПО Заказы.Ссылка = ИтогиТоваров.Заказ";
РезультатЗапроса = Запрос.Выполнить();
