Запрос = Новый Запрос;
Запрос.Текст =
"ВЫБРАТЬ
|    Остатки.Номенклатура КАК Номенклатура,
|    Остатки.КоличествоОстаток КАК Остаток
|ПОМЕСТИТЬ ВТОстатки
|ИЗ
|    РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата,) КАК Остатки
|ИНДЕКСИРОВАТЬ ПО
|    Номенклатура
|;
|ВЫБРАТЬ
|    Номенклатура.Ссылка КАК Ссылка,
|    ВТОстатки.КоличествоОстаток КАК Остаток
|ИЗ
|    Справочник.Номенклатура КАК Номенклатура
|        ЛЕВОЕ СОЕДИНЕНИЕ ВТОстатки КАК ВТОстатки
|        ПО Номенклатура.Ссылка = ВТОстатки.Номенклатура";
Запрос.УстановитьПараметр("Дата", Дата);
РезультатЗапроса = Запрос.Выполнить();
