Процедура СписатьТовары(Склад, Контрагент)
    Блокировка = Новый БлокировкаДанных;
    Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
    Блокировка.Добавить("РегистрНакопления.РасчетыСКонтрагентами");
    Блокировка.Заблокировать();
    ПровестиСписание(Склад, Контрагент);
КонецПроцедуры

Процедура НачислитьДолг(Склад, Контрагент)
    Блокировка = Новый БлокировкаДанных;
    Блокировка.Добавить("РегистрНакопления.РасчетыСКонтрагентами");
    Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
    Блокировка.Заблокировать();
    ПровестиНачисление(Склад, Контрагент);
КонецПроцедуры
