Процедура ПровестиДокумент(Документ)
    Если Не Документ.Проведен Тогда
        НачатьТранзакцию();
        Попытка
            Документ.Записать(РежимЗаписиДокумента.Проведение);
            ЗафиксироватьТранзакцию();
        Исключение
            ОтменитьТранзакцию();
            ВызватьИсключение;
        КонецПопытки;
    КонецЕсли;
    Если Документ.Проведен Тогда
        Печать.НапечататьДокумент(Документ);
    КонецЕсли;
КонецПроцедуры

Процедура ЗаписатьЧерновик(Документ)
    Документ.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры
