Схема = Новый СхемаКомпоновкиДанных;
Набор = Схема.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
Набор.Запрос =
"ВЫБРАТЬ
|    Продажи.Период КАК Период,
|    Продажи.Контрагент КАК Контрагент,
|    Продажи.Сумма КАК Сумма
|ИЗ
|    РегистрНакопления.Продажи КАК Продажи";
ЭлементОтбора = Схема.НастройкиПоУмолчанию.Отбор.Элементы.Добавить(
    Тип("ЭлементОтбораКомпоновкиДанных"));
ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиДанных("Период");
ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
