Процедура СписатьОстаток(Склад, Номенклатура)
    Блокировка = Новый БлокировкаДанных;
    ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
    ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
    Блокировка.Заблокировать();
    Остаток = ПрочитатьОстаток(Склад, Номенклатура);
    Если Остаток < КоличествоСписания Тогда
        ВызватьИсключение НСтр("ru = 'Остатка не хватает'");
    КонецЕсли;
    ЗаписатьСписание(Склад, Номенклатура, КоличествоСписания);
КонецПроцедуры
