Процедура УдалитьДокумент(СсылкаДокумента)
    Если НЕ ПравоДоступа("Удаление", СсылкаДокумента.Метаданные()) Тогда
        ВызватьИсключение НСтр("ru = 'Нет права на удаление документа'");
    КонецЕсли;
    УстановитьПривилегированныйРежим(Истина);
    Попытка
        ДокументОбъект = СсылкаДокумента.ПолучитьОбъект();
        ДокументОбъект.Удалить();
        УстановитьПривилегированныйРежим(Ложь);
    Исключение
        УстановитьПривилегированныйРежим(Ложь);
        ВызватьИсключение;
    КонецПопытки;
КонецПроцедуры
