Остатки = Новый ТаблицаЗначений;
Остатки.Колонки.Добавить("Номенклатура");
Остатки.Колонки.Добавить("Склад");
Остатки.Колонки.Добавить("Количество");
Остатки.Индексы.Добавить("Номенклатура, Склад");
Для Каждого Строка Из ТаблицаОстатков Цикл
    НоваяСтрока = Остатки.Добавить();
    НоваяСтрока.Номенклатура = Строка.Номенклатура;
    НоваяСтрока.Склад = Строка.Склад;
    НоваяСтрока.Количество = Строка.Количество;
КонецЦикла;
НайденныеСтроки = Остатки.НайтиСтроки(
    Новый Структура("Номенклатура, Склад", Товар, Склад));
Найдено = 0;
Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
    Найдено = НайденныеСтроки[0].Количество;
КонецЕсли;
